app/Controllers/Con_pasar.php

SELECT *
FROM `tb_pasar`
---
    public function index()
    {
        //cek apakah ada session bernama isLogin
        if (!$this->session->has('isLogin')) {
            return redirect()->to('/Auth/login');
        }

        //cek role dari session
        if ($this->session->get('hak_akses') != 1) {
            return redirect()->to('/user');
        }

        $pasar = $this->Mod_pasar->findAll();

INSERT INTO `tb_pasar` (`nama_pasar`, `nama_penjual`, `created_at_pasar`) VALUES ('Pasar raya bogor', 'Pak yasin', '2023-07-10 09:01:48')
---
    function tambah_pasar()
    {
        $input = $this->request->getPost();
        $nama_pasar = ucfirst($input['nama_pasar']);
        $nama_penjual = ucfirst($input['nama_penjual']);

        $data = [
            'nama_pasar' => $nama_pasar,
            'tanggal' => $input['tgl'],
            'nama_penjual' => $nama_penjual,
        ];

        $status = $this->Mod_pasar->insert($data);